name: "model_pipeline"
platform: "ensemble"
input [
  {
    name: "IMAGE"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]
output [
  {
    name: "BBOXES"
    data_type: TYPE_FP32
    dims: [-1, 6]
  },
  {
    name: "CLASSIFICATION"
    data_type: TYPE_FP32
    dims: [ -1, 3 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "detection"
      model_version: -1
      input_map {
        key: "images"
        value: "IMAGE"
      }
      output_map {
        key: "output"
        value: "DETECTION"
      }
    },
   {
      model_name: "post_detection"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "IMAGE"
      }
      input_map {
        key: "INPUT1"
        value: "DETECTION"
      }
      output_map {
        key: "OUTPUT0"
        value: "crops"
      }
      output_map {
        key: "OUTPUT1"
        value: "BBOXES"
      }
    },
    {
      model_name: "classification"
      model_version: -1
      input_map {
        key: "input_1"
        value: "crops"
      }
      output_map {
        key: "dense"
        value: "CLASSIFICATION"
      }
    }
  ]
}
