name: "classification"
platform: "tensorflow_savedmodel"
input [
  {
    name: "input_1"
    data_type: TYPE_FP32
    dims: [-1, 260, 260, 3 ]
  }
]
output [
  {
    name: "dense"
    data_type: TYPE_FP32
    dims: [-1, 3]
  }
]
